# IdeaStatiCa.ConnectionApi.Model.ConMember

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**IsContinuous** | **bool** |  | [optional]
**CrossSectionId** | **int?** |  | [optional]
**ConnectedBy** | **ConMemberConnectedByEnum** |  | [optional]
**MirrorY** | **bool?** |  | [optional]
**MirrorZ** | **bool?** |  | [optional]
**IsBearing** | **bool** |  | [optional]
**Position** | **ConMemberPosition** |  | [optional]
**Model** | **ConMemberModel** |  | [optional]
**StiffnessAnalysis** | **ConStiffnessAnalysis** |  | [optional]
**Id** | **int** |  | [optional]
**Name** | **string** |  | [optional]
**Active** | **bool** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)